app/controllers/candidates_controller.rb

  def index
    @page = (params[:page] || 0).to_i
    #@can = Candidate.order(:registration_number).limit(RECORDS_PER_PAGE).offset(RECORDS_PER_PAGE * @page)
    @candidates = if params[:sort].nil?
                    Candidate.order(:registration_number).limit(RECORDS_PER_PAGE).offset(RECORDS_PER_PAGE * @page)
---
SELECT "candidates".* FROM "candidates" ORDER BY "candidates"."registration_number" DESC