app/controllers/candidates_controller.rb

  def index
    @candidates = if params[:sort].nil?
                    Candidate.page(params[:page]).per(2)
---
SELECT "candidates".* FROM "candidates"

  def filter_result
    if params[:sort].nil?
      @filter_query = filter_params.delete_if { |_key, value| value.blank? }.to_s
      @candidates = Candidate.filter_records(filter_params).page(params[:page]).per(2)
---
SELECT "candidates".* FROM "candidates"

  def create
    @candidate = Candidate.new(candidate_params)
    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("date_of_registration", "date_of_closure", "address", "branch", "contact_number", "email", "experience", "gender", "name", "qualification", "registration_number", "specialization", "source_of_registration", "state", "status", "zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def update
    respond_to do |format|
      if @candidate.update(candidate_params)
        Candidate.update_source(@candidate.source_of_registration,@candidate.id)
---
UPDATE "candidates" SET "address" = $1, "age" = $2, "branch" = $3, "contact_number" = $4, "email" = $5, "experience" = $6, "gender" = $7, "qualification" = $8, "remarks" = $9, "specialization" = $10, "zone" = $11, "date_of_registration" = $12, "date_of_closure" = $13, "updated_at" = $14 WHERE "candidates"."id" = $15
UPDATE "candidates" SET "remarks" = $1, "date_of_registration" = $2, "updated_at" = $3 WHERE "candidates"."id" = $4  [["remarks", 0], ["date_of_registration", "2019-06-04"], ["updated_at", "2019-07-05 06:32:24.339948"], ["id", 5]]

  def destroy
    @candidate.destroy
---
DELETE FROM "candidates" WHERE "candidates"."id" = $1  [["id", 1]]